################
# Repositories #
################

tap 'homebrew/cask'


############
# Packages #
############

# Core Utilities
brew 'jandedobbeleer/oh-my-posh/oh-my-posh'
brew 'readline'
brew 'xz'
brew 'stow'
brew 'git'
brew 'neovim'
brew 'fzf'
brew 'mas'

# GoLang
brew 'goenv'

# Python
brew 'pyenv'
brew 'pyright'

# Basic Utility Replacers
brew 'zoxide'
brew 'bat'
brew 'eza'

# Fonts
brew 'font-fira-code'


#####################
# Application Casks #
#####################

# MS Office
cask 'microsoft-outlook'
cask 'microsoft-excel'
cask 'microsoft-word'

# Communications
cask 'discord'
cask 'slack'
cask 'whatsapp'
cask 'zoom'

# Utilities and Services
cask 'bartender'
cask 'sensiblesidebuttons'
cask 'mos'
cask 'rectangle-pro'
cask 'bitwarden'
cask 'obsbot-center'
cask 'cursorsense'

# Gaming
cask 'parsec'
cask 'steam'

# SWE
cask 'docker'
cask 'wezterm'

# Other
cask 'qbittorrent'
cask 'surfshark'
cask 'chatgpt'
cask 'arc'
cask 'spotify'


#############
# App Store #
#############

mas 'iStatistica Pro', id: 1447778660
mas 'Caffeinated', id: 1362171212
mas 'Paprika Recipe Manager 3', id: 1303222628
